In [17]:
import numpy as np
import pandas as pd

In [18]:
data={'company':['GOOGLE','GOOGLE','AMAZON','AMAZON','FACEBOOK','FACEBOOK'],
      'person':['SHIB','SAM','SANGY','DEEPAK','PRADEEP','SATYA'],
     'sales':[200,120,340,124,243,350]}

In [19]:
data

{'company': ['GOOGLE', 'GOOGLE', 'AMAZON', 'AMAZON', 'FACEBOOK', 'FACEBOOK'],
 'person': ['SHIB', 'SAM', 'SANGY', 'DEEPAK', 'PRADEEP', 'SATYA'],
 'sales': [200, 120, 340, 124, 243, 350]}

In [20]:
df=pd.DataFrame(data)

In [21]:
df

    company   person  sales
0    GOOGLE     SHIB    200
1    GOOGLE      SAM    120
2    AMAZON    SANGY    340
3    AMAZON   DEEPAK    124
4  FACEBOOK  PRADEEP    243
5  FACEBOOK    SATYA    350

In [25]:
df

    company   person  sales
0    GOOGLE     SHIB    200
1    GOOGLE      SAM    120
2    AMAZON    SANGY    340
3    AMAZON   DEEPAK    124
4  FACEBOOK  PRADEEP    243
5  FACEBOOK    SATYA    350

df1

In [35]:
df[['company','sales']]

    company  sales
0    GOOGLE    200
1    GOOGLE    120
2    AMAZON    340
3    AMAZON    124
4  FACEBOOK    243
5  FACEBOOK    350

In [36]:
df1=df[['company','sales']]

In [37]:
df1

    company  sales
0    GOOGLE    200
1    GOOGLE    120
2    AMAZON    340
3    AMAZON    124
4  FACEBOOK    243
5  FACEBOOK    350

In [40]:
df1.groupby('company').mean()

          sales
company
AMAZON    232.0
FACEBOOK  296.5
GOOGLE    160.0

df1.groupby('company').mean()

In [41]:
df.groupby('company').max()

         person  sales
company
AMAZON    SANGY    340
FACEBOOK  SATYA    350
GOOGLE     SHIB    200

In [42]:
df

    company   person  sales
0    GOOGLE     SHIB    200
1    GOOGLE      SAM    120
2    AMAZON    SANGY    340
3    AMAZON   DEEPAK    124
4  FACEBOOK  PRADEEP    243
5  FACEBOOK    SATYA    350

In [43]:
df1.groupby('company').std()

               sales
company
AMAZON    152.735065
FACEBOOK   75.660426
GOOGLE     56.568542

In [46]:
df1.groupby('company').max().loc['AMAZON']

sales    340
Name: AMAZON, dtype: int64

df1.groupby('company').count()

In [47]:
df1.groupby('company').count()

          sales
company
AMAZON        2
FACEBOOK      2
GOOGLE        2

In [48]:
df.groupby('company').min()

SyntaxError: invalid syntax (<ipython-input-48-f7a69c320d1a>, line 1)

In [49]:
df.groupby('company').describe()

         sales
         count   mean         std    min     25%    50%     75%    max
company
AMAZON     2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
FACEBOOK   2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE     2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0

In [50]:
df.groupby('company').describe().transpose()

company          AMAZON    FACEBOOK      GOOGLE
sales count    2.000000    2.000000    2.000000
      mean   232.000000  296.500000  160.000000
      std    152.735065   75.660426   56.568542
      min    124.000000  243.000000  120.000000
      25%    178.000000  269.750000  140.000000
      50%    232.000000  296.500000  160.000000
      75%    286.000000  323.250000  180.000000
      max    340.000000  350.000000  200.000000

In [ ]:
df.groupby('comp')